import {கட்டுரைகள்} from "../கோப்பு/கட்டுரைகள்.js";

const _கட்டுரைகள் = கட்டுரைகள்;

let கதைகள் = {};

export const கட்டுரை_பணி = {
    கதையைத்தா: கதைப்பெயர் => {
        if(கதைகள்[கதைப்பெயர்] === undefined) {
            return _கட்டுரைகள்[கதைப்பெயர்]().then(கதை => {
                let யாப்பு = '<div class="சிறுகதைகள்">' + கதை + '</div>';
                கதைகள்[கதைப்பெயர்] = யாப்பு;
                return யாப்பு;
            });
        }
        return Promise.resolve(கதைகள்[கதைப்பெயர்]);
    }
};