import {சிறுகதைகள்} from "../கோப்பு/சிறுகதைகள்.js";

const _சிறுகதைகள் = சிறுகதைகள்;

let கதைகள் = {};

export const சிறுகதை_சேவை = {
    கதையைத்தா: கதைப்பெயர் => {
        if(கதைகள்[கதைப்பெயர்] === undefined) {
            return _சிறுகதைகள்[கதைப்பெயர்]().then(கதை => {
                let யாப்பு = '<div class="சிறுகதைகள்">' + கதை + '</div>';
                கதைகள்[கதைப்பெயர்] = யாப்பு;
                return யாப்பு;
            });
        }
        return Promise.resolve(கதைகள்[கதைப்பெயர்]);
    }
};