import {மொழிபெயரியல்கள்_கோப்பு} from "../கோப்பு/மொழிபெயரியல்கள்.js";

const _மொழிபெயரியல்கள் = மொழிபெயரியல்கள்_கோப்பு;

let மொழிபெயரியல்கள் = {};

export const மொழிபெயர்ப்பு_சேவை = {
    உட்பட்டியலுடையாதா: பெயர் => {
        return !(_மொழிபெயரியல்கள்[பெயர்] instanceof Function)
    },

    கதையைத்தா: (நூற்பெயர், இயற்பெயர்) => {
        let பெயர் = நூற்பெயர் + "_|_" + இயற்பெயர்;
        if(மொழிபெயரியல்கள்[பெயர்] === undefined) {
            return (இயற்பெயர் ? _மொழிபெயரியல்கள்[நூற்பெயர்][இயற்பெயர்] : _மொழிபெயரியல்கள்[நூற்பெயர்])()
                .then(கதை => {
                    let யாப்பு = '<div class="சிறுகதைகள்">' + கதை + '</div>';
                    மொழிபெயரியல்கள்[பெயர்] = யாப்பு;
                    return யாப்பு;
                });
        }
        return Promise.resolve(மொழிபெயரியல்கள்[பெயர்]);
    }
};