import {மொழிப்பெயரியல்கள்} from "../கோப்பு/மொழிப்பெயரியல்கள்.js";

const _மொழிப்பெயரியல்கள் = மொழிப்பெயரியல்கள்;

let மொழிப்பெயரியல்கள் = {};

export const மொழிபெயர்ப்பு_சேவை = {
    கதையைத்தா: (நூற்பெயர், இயற்பெயர்) => {
        let பெயர் = நூற்பெயர் + "_|_" + இயற்பெயர்;
        if(மொழிப்பெயரியல்கள்[பெயர்] === undefined) {
            return _மொழிப்பெயரியல்கள்[நூற்பெயர்][இயற்பெயர்]().then(கதை => {
                let யாப்பு = '<div class="சிறுகதைகள்">' + கதை + '</div>';
                மொழிப்பெயரியல்கள்[பெயர்] = யாப்பு;
                return யாப்பு;
            });
        }
        return Promise.resolve(மொழிப்பெயரியல்கள்[பெயர்]);
    }
};