const அச்சுக்கட்டங்கள் = "<div class='கட்டங்கள்'> %s </div>"
const அச்சுக்கட்டம் = "<div class='கட்டம் 1_கட்டம்'><span> 2 </span></div>"

const தலைப்பின்வகை = தலைப்பு => {
    let வகை = 'பெருந்தலைப்பு';
    if(தலைப்பு.length < 12) {
        வகை = 'குறுந்தலைப்பு';
    } else if(தலைப்பு.length < 30) {
        வகை = 'நெடுந்தலைப்பு';
    }
    return வகை + ' ' +தலைப்பு;
}

export const பட்டியலி = {
    செதுக்கு: (நிறுவு, பட்டியல்) => {
        let கட்டங்கள் = "";
        பட்டியல்.forEach(உறுப்பு => {
            கட்டங்கள் += அச்சுக்கட்டம்
                .replace(/1/g, தலைப்பின்வகை(உறுப்பு['பெயர்']))
                .replace(/2/g, உறுப்பு['பெயர்'].replace(/_/g,' ')) + "\n";
        });
        நிறுவு(அச்சுக்கட்டங்கள்.replace('%s', கட்டங்கள்), () => {
            பட்டியல்.forEach(உறுப்பு => {
                document.querySelector("."+உறுப்பு['பெயர்']+"_கட்டம்").addEventListener('click',உறுப்பு['தீண்டுவினை']);
            });
        });
    }
};