import "./பட்டியல்.css";

const அச்சுக்கட்டங்கள் = "<div class='கட்டங்கள்'> %s </div>"
const அச்சுக்கட்டம் = "<div class='கட்டம் %s'><span> %s </span></div>"

export const பட்டியலி = {
    செதுக்கு: (நிறுவு, பட்டியல்) => {
        let கட்டங்கள் = "";
        பட்டியல்.forEach(உறுப்பு => {
            கட்டங்கள் += அச்சுக்கட்டம்.replace(/%s/g, உறுப்பு['பெயர்']) + "\n";
        });
        நிறுவு(அச்சுக்கட்டங்கள்.replace('%s', கட்டங்கள்), () => {
            பட்டியல்.forEach(உறுப்பு => {
                document.querySelector("."+உறுப்பு['பெயர்']).addEventListener('click',உறுப்பு['தீண்டுவினை']);
            });
        });
    }
};