export const சிறுகதைகள் = {
    "தேர்வு":  {
        கரு: () => import("../../களஞ்சியம்/சிறுகதைகள்/தேர்வு.html"),
        விளக்கம்: "‘நாளை எஃசாம் எழுத போவாதடீ!’ - இப்படி சொல்லமாட்டாளா என்று என் மனம் ஏங்குகிறது."
    },
    "தரிசனம்": {
        கரு: () => import("../../களஞ்சியம்/சிறுகதைகள்/தரிசனம்.html"),
        விளக்கம்: "“புதுசு புதுசா வைரசு, கேன்சரெல்லாம் வருதே சாமி, அத நீங்க அழிக்கக் கூடாதா?”...“நீங்கக்கூடத்தான் இயற்கைக்கே தொந்தரவா இருக்கீங்க உங்களை அழித்திடலாமா?”"
    },
    "எஞ்சினியர்": {
        கரு: () => import("../../களஞ்சியம்/சிறுகதைகள்/எஞ்சினியர்.html"),
        விளக்கம்: "பரந்த ஏரி, இரண்டு கிலோமீட்டர் இருக்கும், அதன் விட்டம். ஏரியின் மய்யத்தில் வெளுத்த செவ்வகம், அதுதான் இவர்களின் ஆட்டக்களம்."
    }
};