export const மொழிபெயரியல்கள்_கோப்பு = {
    "ஆனாப்பிராங்கின்_நாட்குறிப்பு": {
        "முன்னுரை": () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/முன்னுரை.html"),
        "இயல்_ஒன்று": () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_ஒன்று.html"),
        "இயல்_இரண்டு": () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_இரண்டு.html"),
        "இயல்_மூன்று": () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_மூன்று.html"),
        "இயல்_நான்கு": () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_நான்கு.html"),
        "இயல்_ஐந்து": () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_ஐந்து.html"),
        "இயல்_ஆறு": () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_ஆறு.html"),
        "இயல்_ஏழு" : () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_ஏழு.html"),
        "இயல்_எட்டு" : () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_எட்டு.html"),
        "பெயர்கள்": () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/பெயர்கள்.html")
    }
};