import {மொழிப்பெயரியல்கள்} from "./மொழிப்பெயரியல்கள்.js";

const _மொழிப்பெயரியல்கள் = மொழிப்பெயரியல்கள்;

const முகவரி = '#மொழிபெயர்ப்புகள்/';

export const மொழிப்பெயர்ப்பட்டியலி = {
    பட்டியலைத்தா: () => {
        let பட்டியல் = [];
        Object.keys(_மொழிப்பெயரியல்கள்).forEach(பெயர் => {
            பட்டியல்.push({
                'பெயர்': பெயர்,
                'தீண்டுவினை': () => {
                    window.location.href = window.location.href.split('#')[0] + முகவரி + பெயர்;
                }
            });
        });
        return பட்டியல்;
    }
};