export const மொழிபெயரியல்கள்_கோப்பு = {
    "ஆனாப்பிராங்கின்_நாட்குறிப்பு": {
        "முன்னுரை": {
            கரு: () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/முன்னுரை.html"),
            விளக்கம்: "ஆனாவின் தெளிவும் உள்ளுரமும் வியப்பாக இருக்கிறது. அச்சிறு அகவையில் அவள் எப்படி அவ்வளவு மனத்தெளிவுடன் தன் உலகத்தை உள்வாங்குகிறாள்?"
        },
        "இயல்_ஒன்று": {
            கரு: () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_ஒன்று.html"),
            விளக்கம்: "ஆனாவின் தெளிவும் உள்ளுரமும் வியப்பாக இருக்கிறது. அச்சிறு அகவையில் அவள் எப்படி அவ்வளவு மனத்தெளிவுடன் தன் உலகத்தை உள்வாங்குகிறாள்?"
        },
        "இயல்_இரண்டு": {
            கரு: () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_இரண்டு.html"),
            விளக்கம்: "ஆனாவின் தெளிவும் உள்ளுரமும் வியப்பாக இருக்கிறது. அச்சிறு அகவையில் அவள் எப்படி அவ்வளவு மனத்தெளிவுடன் தன் உலகத்தை உள்வாங்குகிறாள்?"
        },
        "இயல்_மூன்று": {
            கரு: () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_மூன்று.html"),
            விளக்கம்: "ஆனாவின் தெளிவும் உள்ளுரமும் வியப்பாக இருக்கிறது. அச்சிறு அகவையில் அவள் எப்படி அவ்வளவு மனத்தெளிவுடன் தன் உலகத்தை உள்வாங்குகிறாள்?"
        },
        "இயல்_நான்கு": {
            கரு: () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_நான்கு.html"),
            விளக்கம்: "ஆனாவின் தெளிவும் உள்ளுரமும் வியப்பாக இருக்கிறது. அச்சிறு அகவையில் அவள் எப்படி அவ்வளவு மனத்தெளிவுடன் தன் உலகத்தை உள்வாங்குகிறாள்?"
        },
        "இயல்_ஐந்து": {
            கரு: () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_ஐந்து.html"),
            விளக்கம்: "ஆனாவின் தெளிவும் உள்ளுரமும் வியப்பாக இருக்கிறது. அச்சிறு அகவையில் அவள் எப்படி அவ்வளவு மனத்தெளிவுடன் தன் உலகத்தை உள்வாங்குகிறாள்?"
        },
        "இயல்_ஆறு": {
            கரு: () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_ஆறு.html"),
            விளக்கம்: "ஆனாவின் தெளிவும் உள்ளுரமும் வியப்பாக இருக்கிறது. அச்சிறு அகவையில் அவள் எப்படி அவ்வளவு மனத்தெளிவுடன் தன் உலகத்தை உள்வாங்குகிறாள்?"
        },
        "இயல்_ஏழு" : {
            கரு: () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_ஏழு.html"),
            விளக்கம்: "ஆனாவின் தெளிவும் உள்ளுரமும் வியப்பாக இருக்கிறது. அச்சிறு அகவையில் அவள் எப்படி அவ்வளவு மனத்தெளிவுடன் தன் உலகத்தை உள்வாங்குகிறாள்?"
        },
        "இயல்_எட்டு" : {
            கரு: () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/இயல்_எட்டு.html"),
            விளக்கம்: "ஆனாவின் தெளிவும் உள்ளுரமும் வியப்பாக இருக்கிறது. அச்சிறு அகவையில் அவள் எப்படி அவ்வளவு மனத்தெளிவுடன் தன் உலகத்தை உள்வாங்குகிறாள்?"
        },
        "பெயர்கள்": {
            கரு: () => import("../../களஞ்சியம்/மொழிபெயர்ப்புகள்/ஆனாப்பிராங்கின்_நாட்குறிப்பு/பெயர்கள்.html"),
            விளக்கம்: "ஆனாவின் தெளிவும் உள்ளுரமும் வியப்பாக இருக்கிறது. அச்சிறு அகவையில் அவள் எப்படி அவ்வளவு மனத்தெளிவுடன் தன் உலகத்தை உள்வாங்குகிறாள்?"
        },
        விளக்கம்: "ஆனாவின் தெளிவும் உள்ளுரமும் வியப்பாக இருக்கிறது. அச்சிறு அகவையில் அவள் எப்படி அவ்வளவு மனத்தெளிவுடன் தன் உலகத்தை உள்வாங்குகிறாள்?"
    }
};