import {பட்டியலி} from "../../பாகங்கள்/பட்டியல்/பட்டியல்.js";
import {பக்கக்குறிப்பி} from "../../பாகங்கள்/பக்கக்குறிப்பு/பக்கக்குறிப்பு.js";
import {கட்டுரைப்பட்டியலி} from "../பணி/கட்டுரைப்பட்டியல்.js";
import {கட்டுரை_பணி} from "../பணி/கட்டுரை.js";

const _பட்டியலி = பட்டியலி;
const _கட்டுரைப்பட்டியலி = கட்டுரைப்பட்டியலி;
const _கட்டுரை_பணி = கட்டுரை_பணி;
const _பக்கக்குறிப்பி = பக்கக்குறிப்பி;
const கொக்கி = document.querySelector(".கொக்கி");
const விளக்கம் = document.querySelector('meta[name="description"]');
const தலைப்பு = document.querySelector('title');

export const கட்டுரை_திசைவி = {
    திசைவி: (பக்கம், நிறுவு) => {
        if (கொக்கி) {
            கொக்கி.innerHTML = "கட்டுரைகள்";
        }
        தலைப்பு.innerHTML = "உலகனின் செந்தமிழ் கட்டுரைகள்";
        விளக்கம்.content = "உலகனின் சிந்தனைகளை செந்தமிழில் வடித்தெடுத்த கட்டுரைகள்";
        if(பக்கம்.includes('/')) {
            let துணுக்குகள் = பக்கம்.split('/');
            _கட்டுரை_பணி.கதையைத்தா(துணுக்குகள்[1]).then(கதை => {
                நிறுவு(கதை, () => {
                    _பக்கக்குறிப்பி.செதுக்கு(துணுக்குகள்[1]);
                });
                தலைப்பு.innerHTML = "உலகனின் கட்டுரை: " + துணுக்குகள்[1];
                விளக்கம்.content = _கட்டுரை_பணி.விளக்கம்(துணுக்குகள்[1]);
            });

        } else {
            _பட்டியலி.செதுக்கு(நிறுவு, _கட்டுரைப்பட்டியலி.பட்டியலைத்தா());
        }
    }
}