import {பட்டியலி} from "../../பாகங்கள்/பட்டியல்/பட்டியல்.js";
import {பக்கக்குறிப்பி} from "../../பாகங்கள்/பக்கக்குறிப்பு/பக்கக்குறிப்பு.js";
import {சிறுகதைப்பட்டியலி} from "../பணி/சிறுகதைப்பட்டியல்.js";
import {சிறுகதை_பணி} from "../பணி/சிறுகதை.js";

const _பட்டியலி = பட்டியலி;
const _சிறுகதைப்பட்டியலி = சிறுகதைப்பட்டியலி;
const _சிறுகதை_பணி = சிறுகதை_பணி;
const _பக்கக்குறிப்பி = பக்கக்குறிப்பி;
const கொக்கி = document.querySelector(".கொக்கி");
const விளக்கம் = document.querySelector('meta[name="description"]');
const தலைப்பு = document.querySelector('title');

export const சிறுகதை_திசைவி = {
    திசைவி: (பக்கம், நிறுவு) => {
        if (கொக்கி) {
            கொக்கி.innerHTML = "சிறுகதைகள்";
        }
        தலைப்பு.innerHTML = "உலகனின் சிறுகதைகள்";
        விளக்கம்.content = "உலகை ஒரு தமிழனின் பார்வையில் நோட்டமிட, உலகனின் சிறுகதைகள்.";
        if(பக்கம்.includes('/')) {
            let துணுக்குகள் = பக்கம்.split('/');
            _சிறுகதை_பணி.கதையைத்தா(துணுக்குகள்[1]).then(கதை => {
                நிறுவு(கதை, () => {
                    _பக்கக்குறிப்பி.செதுக்கு(துணுக்குகள்[1]);
                });
            });
            தலைப்பு.innerHTML = "உலகனின் சிறுகதை: " + துணுக்குகள்[1];
            விளக்கம்.content = _சிறுகதை_பணி.விளக்கம்(துணுக்குகள்[1]);
        } else {
            _பட்டியலி.செதுக்கு(நிறுவு, _சிறுகதைப்பட்டியலி.பட்டியலைத்தா());
        }
    }
}