import {பட்டியலி} from "../../பாகங்கள்/பட்டியல்/பட்டியல்.js";
import {பக்கக்குறிப்பி} from "../../பாகங்கள்/பக்கக்குறிப்பு/பக்கக்குறிப்பு.js";
import {சிறுகதைப்பட்டியலி} from "../சேவை/சிறுகதைப்பட்டியல்.js";
import {சிறுகதை_சேவை} from "../சேவை/சிறுகதை.js";

const _பட்டியலி = பட்டியலி;
const _சிறுகதைப்பட்டியலி = சிறுகதைப்பட்டியலி;
const _சிறுகதை_சேவை = சிறுகதை_சேவை;
const _பக்கக்குறிப்பி = பக்கக்குறிப்பி;

export const சிறுகதை_திசைவி = {
    திசைவி: (பக்கம், நிறுவு) => {
        if(பக்கம்.includes('/')) {
            let துணுக்குகள் = பக்கம்.split('/');
            _சிறுகதை_சேவை.கதையைத்தா(துணுக்குகள்[1]).then(கதை => {
                நிறுவு(கதை, () => {
                    _பக்கக்குறிப்பி.செதுக்கு(துணுக்குகள்[1]);
                });
            });
        } else {
            _பட்டியலி.செதுக்கு(நிறுவு, _சிறுகதைப்பட்டியலி.பட்டியலைத்தா());
        }
    }
}