import {சிறுகதை_திசைவி} from "./சிறுகதை.js";
import {கட்டுரை_திசைவி} from "./கட்டுரை.js";
import {மொழிபெயர்ப்பு_திசைவி} from "./மொழிபெயர்ப்பு.js";
import {விழித்தளவி} from "../../பாகங்கள்/விழித்தளம்/விழித்தளம்.js";
import {இணைப்பு_பணி} from "../பணி/இணைப்பு.js";

const தளம் = document.querySelector(".தளம்");

const நிறுவு = (பக்கம், பின்பழை = ()=>{}) => {
    தளம்.innerHTML = பக்கம்;
    பின்பழை();
    இணைப்பு_பணி.உருவாக்கு();
};

const திசைவி = முகவரி => {
    let பகுதி = முகவரி.split('#');
    if(பகுதி.length == 2) {
        let பக்கம் = decodeURI(பகுதி[1]);
        if(பக்கம்.match('^சிறுகதைகள்') != null) {
            சிறுகதை_திசைவி.திசைவி(பக்கம், நிறுவு)
        } else if(பக்கம்.match('^மொழிபெயர்ப்புகள்') != null) {
            மொழிபெயர்ப்பு_திசைவி.திசைவி(பக்கம், நிறுவு)
        } else if(பக்கம்.match('^கட்டுரைகள்') != null) {
            கட்டுரை_திசைவி.திசைவி(பக்கம், நிறுவு)
        }
    } else {
        விழித்தளவி.செதுக்கு(நிறுவு);
    }
};

/**
 * ஒரு பக்கம் செதுக்கப்பட்டு திரையில் வரும்போது,
 * அதில் நமக்கு தேவையான மாற்றங்களை ஏற்படுத்தவும் 
 * அந்த பக்கத்தின் பொறிகளை பயன்படுத்தவும், தேவையான 
 * கட்டளைகளை இந்த துவக்கியில் எழுதிக்கொள்ளலாம்.
 */
const துவக்கி = () => {
    let கையாளிகள் = [];
    let சுருண்டது = true;
    /**
     * சுருட்பட்டையின் புலனை உய்க்கும் வினை.
     * ஒவ்வொரு முறையும் சுருள் நிலை மாறும்போது
     * பின்வரும் வினை செயல்படுத்தப்படும்.
     * 
     * மேலும் சுருட்பாட்டைப் பொறியில்,
     * கையாளிகளை கோரும் திறனையும் சேர்க்கிறோம். 
     * எனவே சுருட்பாட்டைப் பொறியில்,
     * தேவையான இடங்களில் தத்தம் கையாளிகளை சேர்த்துக்கொள்ளலாம்.
     * 
     * @param {*} வினை 
     */
    window.onscroll = வினை => {
        if(வினை) {
            if(சுருண்டது) {
                setTimeout(() => {
                    கையாளிகள்.forEach(கையாளி => கையாளி());
                    சுருண்டது = true;
                },500);
                சுருண்டது = false;
            }
        }
        return {
            கோர்: கையாளி => {
                கையாளிகள்.push(கையாளி);
            }
        };
    };
};

window.addEventListener('hashchange', வினை => {
    திசைவி(வினை.newURL);
    துவக்கி();
});

window.addEventListener('load', வினை => {
    திசைவி(window.location.href);
    துவக்கி();
});